{
    "ir_version": 9,
    "producer_name": "pytorch",
    "inputs": [
        {
            "name": "images",
            "shape": [
                1,
                3,
                640,
                640
            ]
        }
    ],
    "outputs": [
        {
            "name": "output0",
            "shape": [
                1,
                84,
                8400
            ]
        }
    ],
    "nodes": [
        {
            "name": "/model.0/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "images",
                "model.0.conv.weight",
                "model.0.conv.bias"
            ],
            "outputs": [
                "/model.0/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.0/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.0/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.0/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.0/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.0/conv/Conv_output_0",
                "/model.0/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.0/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.0/act/Mul_output_0",
                "model.1.conv.weight",
                "model.1.conv.bias"
            ],
            "outputs": [
                "/model.1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.1/conv/Conv_output_0",
                "/model.1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.2/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.1/act/Mul_output_0",
                "model.2.cv1.conv.weight",
                "model.2.cv1.conv.bias"
            ],
            "outputs": [
                "/model.2/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.2/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.2/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.2/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.2/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.2/cv1/conv/Conv_output_0",
                "/model.2/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.2/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.2/Split",
            "op_type": "Split",
            "inputs": [
                "/model.2/cv1/act/Mul_output_0",
                "onnx::Split_137"
            ],
            "outputs": [
                "/model.2/Split_output_0",
                "/model.2/Split_output_1"
            ]
        },
        {
            "name": "/model.2/m.0/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.2/Split_output_1",
                "model.2.m.0.cv1.conv.weight",
                "model.2.m.0.cv1.conv.bias"
            ],
            "outputs": [
                "/model.2/m.0/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.2/m.0/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.2/m.0/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.2/m.0/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.2/m.0/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.2/m.0/cv1/conv/Conv_output_0",
                "/model.2/m.0/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.2/m.0/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.2/m.0/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.2/m.0/cv1/act/Mul_output_0",
                "model.2.m.0.cv2.conv.weight",
                "model.2.m.0.cv2.conv.bias"
            ],
            "outputs": [
                "/model.2/m.0/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.2/m.0/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.2/m.0/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.2/m.0/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.2/m.0/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.2/m.0/cv2/conv/Conv_output_0",
                "/model.2/m.0/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.2/m.0/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.2/m.0/Add",
            "op_type": "Add",
            "inputs": [
                "/model.2/Split_output_1",
                "/model.2/m.0/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.2/m.0/Add_output_0"
            ]
        },
        {
            "name": "/model.2/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.2/Split_output_0",
                "/model.2/Split_output_1",
                "/model.2/m.0/Add_output_0"
            ],
            "outputs": [
                "/model.2/Concat_output_0"
            ]
        },
        {
            "name": "/model.2/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.2/Concat_output_0",
                "model.2.cv2.conv.weight",
                "model.2.cv2.conv.bias"
            ],
            "outputs": [
                "/model.2/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.2/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.2/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.2/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.2/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.2/cv2/conv/Conv_output_0",
                "/model.2/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.2/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.3/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.2/cv2/act/Mul_output_0",
                "model.3.conv.weight",
                "model.3.conv.bias"
            ],
            "outputs": [
                "/model.3/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.3/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.3/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.3/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.3/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.3/conv/Conv_output_0",
                "/model.3/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.3/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.4/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.3/act/Mul_output_0",
                "model.4.cv1.conv.weight",
                "model.4.cv1.conv.bias"
            ],
            "outputs": [
                "/model.4/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.4/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.4/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.4/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.4/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.4/cv1/conv/Conv_output_0",
                "/model.4/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.4/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.4/Split",
            "op_type": "Split",
            "inputs": [
                "/model.4/cv1/act/Mul_output_0",
                "onnx::Split_157"
            ],
            "outputs": [
                "/model.4/Split_output_0",
                "/model.4/Split_output_1"
            ]
        },
        {
            "name": "/model.4/m.0/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.4/Split_output_1",
                "model.4.m.0.cv1.conv.weight",
                "model.4.m.0.cv1.conv.bias"
            ],
            "outputs": [
                "/model.4/m.0/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.4/m.0/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.4/m.0/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.4/m.0/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.4/m.0/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.4/m.0/cv1/conv/Conv_output_0",
                "/model.4/m.0/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.4/m.0/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.4/m.0/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.4/m.0/cv1/act/Mul_output_0",
                "model.4.m.0.cv2.conv.weight",
                "model.4.m.0.cv2.conv.bias"
            ],
            "outputs": [
                "/model.4/m.0/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.4/m.0/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.4/m.0/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.4/m.0/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.4/m.0/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.4/m.0/cv2/conv/Conv_output_0",
                "/model.4/m.0/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.4/m.0/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.4/m.0/Add",
            "op_type": "Add",
            "inputs": [
                "/model.4/Split_output_1",
                "/model.4/m.0/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.4/m.0/Add_output_0"
            ]
        },
        {
            "name": "/model.4/m.1/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.4/m.0/Add_output_0",
                "model.4.m.1.cv1.conv.weight",
                "model.4.m.1.cv1.conv.bias"
            ],
            "outputs": [
                "/model.4/m.1/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.4/m.1/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.4/m.1/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.4/m.1/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.4/m.1/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.4/m.1/cv1/conv/Conv_output_0",
                "/model.4/m.1/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.4/m.1/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.4/m.1/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.4/m.1/cv1/act/Mul_output_0",
                "model.4.m.1.cv2.conv.weight",
                "model.4.m.1.cv2.conv.bias"
            ],
            "outputs": [
                "/model.4/m.1/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.4/m.1/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.4/m.1/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.4/m.1/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.4/m.1/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.4/m.1/cv2/conv/Conv_output_0",
                "/model.4/m.1/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.4/m.1/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.4/m.1/Add",
            "op_type": "Add",
            "inputs": [
                "/model.4/m.0/Add_output_0",
                "/model.4/m.1/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.4/m.1/Add_output_0"
            ]
        },
        {
            "name": "/model.4/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.4/Split_output_0",
                "/model.4/Split_output_1",
                "/model.4/m.0/Add_output_0",
                "/model.4/m.1/Add_output_0"
            ],
            "outputs": [
                "/model.4/Concat_output_0"
            ]
        },
        {
            "name": "/model.4/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.4/Concat_output_0",
                "model.4.cv2.conv.weight",
                "model.4.cv2.conv.bias"
            ],
            "outputs": [
                "/model.4/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.4/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.4/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.4/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.4/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.4/cv2/conv/Conv_output_0",
                "/model.4/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.4/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.5/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.4/cv2/act/Mul_output_0",
                "model.5.conv.weight",
                "model.5.conv.bias"
            ],
            "outputs": [
                "/model.5/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.5/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.5/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.5/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.5/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.5/conv/Conv_output_0",
                "/model.5/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.5/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.6/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.5/act/Mul_output_0",
                "model.6.cv1.conv.weight",
                "model.6.cv1.conv.bias"
            ],
            "outputs": [
                "/model.6/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.6/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.6/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.6/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.6/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.6/cv1/conv/Conv_output_0",
                "/model.6/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.6/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.6/Split",
            "op_type": "Split",
            "inputs": [
                "/model.6/cv1/act/Mul_output_0",
                "onnx::Split_184"
            ],
            "outputs": [
                "/model.6/Split_output_0",
                "/model.6/Split_output_1"
            ]
        },
        {
            "name": "/model.6/m.0/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.6/Split_output_1",
                "model.6.m.0.cv1.conv.weight",
                "model.6.m.0.cv1.conv.bias"
            ],
            "outputs": [
                "/model.6/m.0/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.6/m.0/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.6/m.0/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.6/m.0/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.6/m.0/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.6/m.0/cv1/conv/Conv_output_0",
                "/model.6/m.0/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.6/m.0/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.6/m.0/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.6/m.0/cv1/act/Mul_output_0",
                "model.6.m.0.cv2.conv.weight",
                "model.6.m.0.cv2.conv.bias"
            ],
            "outputs": [
                "/model.6/m.0/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.6/m.0/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.6/m.0/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.6/m.0/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.6/m.0/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.6/m.0/cv2/conv/Conv_output_0",
                "/model.6/m.0/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.6/m.0/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.6/m.0/Add",
            "op_type": "Add",
            "inputs": [
                "/model.6/Split_output_1",
                "/model.6/m.0/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.6/m.0/Add_output_0"
            ]
        },
        {
            "name": "/model.6/m.1/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.6/m.0/Add_output_0",
                "model.6.m.1.cv1.conv.weight",
                "model.6.m.1.cv1.conv.bias"
            ],
            "outputs": [
                "/model.6/m.1/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.6/m.1/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.6/m.1/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.6/m.1/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.6/m.1/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.6/m.1/cv1/conv/Conv_output_0",
                "/model.6/m.1/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.6/m.1/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.6/m.1/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.6/m.1/cv1/act/Mul_output_0",
                "model.6.m.1.cv2.conv.weight",
                "model.6.m.1.cv2.conv.bias"
            ],
            "outputs": [
                "/model.6/m.1/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.6/m.1/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.6/m.1/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.6/m.1/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.6/m.1/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.6/m.1/cv2/conv/Conv_output_0",
                "/model.6/m.1/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.6/m.1/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.6/m.1/Add",
            "op_type": "Add",
            "inputs": [
                "/model.6/m.0/Add_output_0",
                "/model.6/m.1/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.6/m.1/Add_output_0"
            ]
        },
        {
            "name": "/model.6/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.6/Split_output_0",
                "/model.6/Split_output_1",
                "/model.6/m.0/Add_output_0",
                "/model.6/m.1/Add_output_0"
            ],
            "outputs": [
                "/model.6/Concat_output_0"
            ]
        },
        {
            "name": "/model.6/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.6/Concat_output_0",
                "model.6.cv2.conv.weight",
                "model.6.cv2.conv.bias"
            ],
            "outputs": [
                "/model.6/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.6/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.6/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.6/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.6/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.6/cv2/conv/Conv_output_0",
                "/model.6/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.6/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.7/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.6/cv2/act/Mul_output_0",
                "model.7.conv.weight",
                "model.7.conv.bias"
            ],
            "outputs": [
                "/model.7/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.7/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.7/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.7/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.7/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.7/conv/Conv_output_0",
                "/model.7/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.7/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.8/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.7/act/Mul_output_0",
                "model.8.cv1.conv.weight",
                "model.8.cv1.conv.bias"
            ],
            "outputs": [
                "/model.8/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.8/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.8/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.8/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.8/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.8/cv1/conv/Conv_output_0",
                "/model.8/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.8/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.8/Split",
            "op_type": "Split",
            "inputs": [
                "/model.8/cv1/act/Mul_output_0",
                "onnx::Split_211"
            ],
            "outputs": [
                "/model.8/Split_output_0",
                "/model.8/Split_output_1"
            ]
        },
        {
            "name": "/model.8/m.0/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.8/Split_output_1",
                "model.8.m.0.cv1.conv.weight",
                "model.8.m.0.cv1.conv.bias"
            ],
            "outputs": [
                "/model.8/m.0/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.8/m.0/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.8/m.0/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.8/m.0/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.8/m.0/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.8/m.0/cv1/conv/Conv_output_0",
                "/model.8/m.0/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.8/m.0/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.8/m.0/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.8/m.0/cv1/act/Mul_output_0",
                "model.8.m.0.cv2.conv.weight",
                "model.8.m.0.cv2.conv.bias"
            ],
            "outputs": [
                "/model.8/m.0/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.8/m.0/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.8/m.0/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.8/m.0/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.8/m.0/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.8/m.0/cv2/conv/Conv_output_0",
                "/model.8/m.0/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.8/m.0/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.8/m.0/Add",
            "op_type": "Add",
            "inputs": [
                "/model.8/Split_output_1",
                "/model.8/m.0/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.8/m.0/Add_output_0"
            ]
        },
        {
            "name": "/model.8/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.8/Split_output_0",
                "/model.8/Split_output_1",
                "/model.8/m.0/Add_output_0"
            ],
            "outputs": [
                "/model.8/Concat_output_0"
            ]
        },
        {
            "name": "/model.8/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.8/Concat_output_0",
                "model.8.cv2.conv.weight",
                "model.8.cv2.conv.bias"
            ],
            "outputs": [
                "/model.8/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.8/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.8/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.8/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.8/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.8/cv2/conv/Conv_output_0",
                "/model.8/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.8/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.9/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.8/cv2/act/Mul_output_0",
                "model.9.cv1.conv.weight",
                "model.9.cv1.conv.bias"
            ],
            "outputs": [
                "/model.9/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.9/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.9/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.9/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.9/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.9/cv1/conv/Conv_output_0",
                "/model.9/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.9/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.9/m/MaxPool",
            "op_type": "MaxPool",
            "inputs": [
                "/model.9/cv1/act/Mul_output_0"
            ],
            "outputs": [
                "/model.9/m/MaxPool_output_0"
            ]
        },
        {
            "name": "/model.9/m_1/MaxPool",
            "op_type": "MaxPool",
            "inputs": [
                "/model.9/m/MaxPool_output_0"
            ],
            "outputs": [
                "/model.9/m_1/MaxPool_output_0"
            ]
        },
        {
            "name": "/model.9/m_2/MaxPool",
            "op_type": "MaxPool",
            "inputs": [
                "/model.9/m_1/MaxPool_output_0"
            ],
            "outputs": [
                "/model.9/m_2/MaxPool_output_0"
            ]
        },
        {
            "name": "/model.9/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.9/cv1/act/Mul_output_0",
                "/model.9/m/MaxPool_output_0",
                "/model.9/m_1/MaxPool_output_0",
                "/model.9/m_2/MaxPool_output_0"
            ],
            "outputs": [
                "/model.9/Concat_output_0"
            ]
        },
        {
            "name": "/model.9/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.9/Concat_output_0",
                "model.9.cv2.conv.weight",
                "model.9.cv2.conv.bias"
            ],
            "outputs": [
                "/model.9/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.9/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.9/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.9/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.9/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.9/cv2/conv/Conv_output_0",
                "/model.9/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.9/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.10/Resize",
            "op_type": "Resize",
            "inputs": [
                "/model.9/cv2/act/Mul_output_0",
                "",
                "/model.10/Constant_output_0"
            ],
            "outputs": [
                "/model.10/Resize_output_0"
            ]
        },
        {
            "name": "/model.11/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.10/Resize_output_0",
                "/model.6/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.11/Concat_output_0"
            ]
        },
        {
            "name": "/model.12/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.11/Concat_output_0",
                "model.12.cv1.conv.weight",
                "model.12.cv1.conv.bias"
            ],
            "outputs": [
                "/model.12/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.12/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.12/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.12/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.12/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.12/cv1/conv/Conv_output_0",
                "/model.12/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.12/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.12/Split",
            "op_type": "Split",
            "inputs": [
                "/model.12/cv1/act/Mul_output_0",
                "onnx::Split_184"
            ],
            "outputs": [
                "/model.12/Split_output_0",
                "/model.12/Split_output_1"
            ]
        },
        {
            "name": "/model.12/m.0/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.12/Split_output_1",
                "model.12.m.0.cv1.conv.weight",
                "model.12.m.0.cv1.conv.bias"
            ],
            "outputs": [
                "/model.12/m.0/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.12/m.0/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.12/m.0/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.12/m.0/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.12/m.0/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.12/m.0/cv1/conv/Conv_output_0",
                "/model.12/m.0/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.12/m.0/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.12/m.0/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.12/m.0/cv1/act/Mul_output_0",
                "model.12.m.0.cv2.conv.weight",
                "model.12.m.0.cv2.conv.bias"
            ],
            "outputs": [
                "/model.12/m.0/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.12/m.0/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.12/m.0/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.12/m.0/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.12/m.0/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.12/m.0/cv2/conv/Conv_output_0",
                "/model.12/m.0/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.12/m.0/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.12/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.12/Split_output_0",
                "/model.12/Split_output_1",
                "/model.12/m.0/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.12/Concat_output_0"
            ]
        },
        {
            "name": "/model.12/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.12/Concat_output_0",
                "model.12.cv2.conv.weight",
                "model.12.cv2.conv.bias"
            ],
            "outputs": [
                "/model.12/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.12/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.12/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.12/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.12/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.12/cv2/conv/Conv_output_0",
                "/model.12/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.12/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.13/Resize",
            "op_type": "Resize",
            "inputs": [
                "/model.12/cv2/act/Mul_output_0",
                "",
                "/model.10/Constant_output_0"
            ],
            "outputs": [
                "/model.13/Resize_output_0"
            ]
        },
        {
            "name": "/model.14/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.13/Resize_output_0",
                "/model.4/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.14/Concat_output_0"
            ]
        },
        {
            "name": "/model.15/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.14/Concat_output_0",
                "model.15.cv1.conv.weight",
                "model.15.cv1.conv.bias"
            ],
            "outputs": [
                "/model.15/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.15/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.15/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.15/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.15/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.15/cv1/conv/Conv_output_0",
                "/model.15/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.15/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.15/Split",
            "op_type": "Split",
            "inputs": [
                "/model.15/cv1/act/Mul_output_0",
                "onnx::Split_157"
            ],
            "outputs": [
                "/model.15/Split_output_0",
                "/model.15/Split_output_1"
            ]
        },
        {
            "name": "/model.15/m.0/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.15/Split_output_1",
                "model.15.m.0.cv1.conv.weight",
                "model.15.m.0.cv1.conv.bias"
            ],
            "outputs": [
                "/model.15/m.0/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.15/m.0/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.15/m.0/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.15/m.0/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.15/m.0/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.15/m.0/cv1/conv/Conv_output_0",
                "/model.15/m.0/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.15/m.0/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.15/m.0/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.15/m.0/cv1/act/Mul_output_0",
                "model.15.m.0.cv2.conv.weight",
                "model.15.m.0.cv2.conv.bias"
            ],
            "outputs": [
                "/model.15/m.0/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.15/m.0/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.15/m.0/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.15/m.0/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.15/m.0/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.15/m.0/cv2/conv/Conv_output_0",
                "/model.15/m.0/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.15/m.0/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.15/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.15/Split_output_0",
                "/model.15/Split_output_1",
                "/model.15/m.0/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.15/Concat_output_0"
            ]
        },
        {
            "name": "/model.15/cv2/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.15/Concat_output_0",
                "model.15.cv2.conv.weight",
                "model.15.cv2.conv.bias"
            ],
            "outputs": [
                "/model.15/cv2/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.15/cv2/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.15/cv2/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.15/cv2/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.15/cv2/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.15/cv2/conv/Conv_output_0",
                "/model.15/cv2/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.15/cv2/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.16/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.15/cv2/act/Mul_output_0",
                "model.16.conv.weight",
                "model.16.conv.bias"
            ],
            "outputs": [
                "/model.16/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.22/cv2.0/cv2.0.0/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.15/cv2/act/Mul_output_0",
                "model.22.cv2.0.0.conv.weight",
                "model.22.cv2.0.0.conv.bias"
            ],
            "outputs": [
                "/model.22/cv2.0/cv2.0.0/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.22/cv3.0/cv3.0.0/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.15/cv2/act/Mul_output_0",
                "model.22.cv3.0.0.conv.weight",
                "model.22.cv3.0.0.conv.bias"
            ],
            "outputs": [
                "/model.22/cv3.0/cv3.0.0/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.16/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.16/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.16/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.22/cv2.0/cv2.0.0/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.22/cv2.0/cv2.0.0/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.22/cv2.0/cv2.0.0/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.22/cv3.0/cv3.0.0/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.22/cv3.0/cv3.0.0/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.22/cv3.0/cv3.0.0/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.16/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.16/conv/Conv_output_0",
                "/model.16/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.16/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.22/cv2.0/cv2.0.0/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.22/cv2.0/cv2.0.0/conv/Conv_output_0",
                "/model.22/cv2.0/cv2.0.0/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.22/cv2.0/cv2.0.0/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.22/cv3.0/cv3.0.0/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.22/cv3.0/cv3.0.0/conv/Conv_output_0",
                "/model.22/cv3.0/cv3.0.0/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.22/cv3.0/cv3.0.0/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.17/Concat",
            "op_type": "Concat",
            "inputs": [
                "/model.16/act/Mul_output_0",
                "/model.12/cv2/act/Mul_output_0"
            ],
            "outputs": [
                "/model.17/Concat_output_0"
            ]
        },
        {
            "name": "/model.22/cv2.0/cv2.0.1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.22/cv2.0/cv2.0.0/act/Mul_output_0",
                "model.22.cv2.0.1.conv.weight",
                "model.22.cv2.0.1.conv.bias"
            ],
            "outputs": [
                "/model.22/cv2.0/cv2.0.1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.22/cv3.0/cv3.0.1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.22/cv3.0/cv3.0.0/act/Mul_output_0",
                "model.22.cv3.0.1.conv.weight",
                "model.22.cv3.0.1.conv.bias"
            ],
            "outputs": [
                "/model.22/cv3.0/cv3.0.1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.18/cv1/conv/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.17/Concat_output_0",
                "model.18.cv1.conv.weight",
                "model.18.cv1.conv.bias"
            ],
            "outputs": [
                "/model.18/cv1/conv/Conv_output_0"
            ]
        },
        {
            "name": "/model.22/cv2.0/cv2.0.1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.22/cv2.0/cv2.0.1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.22/cv2.0/cv2.0.1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.22/cv3.0/cv3.0.1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.22/cv3.0/cv3.0.1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.22/cv3.0/cv3.0.1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.18/cv1/act/Sigmoid",
            "op_type": "Sigmoid",
            "inputs": [
                "/model.18/cv1/conv/Conv_output_0"
            ],
            "outputs": [
                "/model.18/cv1/act/Sigmoid_output_0"
            ]
        },
        {
            "name": "/model.22/cv2.0/cv2.0.1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.22/cv2.0/cv2.0.1/conv/Conv_output_0",
                "/model.22/cv2.0/cv2.0.1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.22/cv2.0/cv2.0.1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.22/cv3.0/cv3.0.1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.22/cv3.0/cv3.0.1/conv/Conv_output_0",
                "/model.22/cv3.0/cv3.0.1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.22/cv3.0/cv3.0.1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.18/cv1/act/Mul",
            "op_type": "Mul",
            "inputs": [
                "/model.18/cv1/conv/Conv_output_0",
                "/model.18/cv1/act/Sigmoid_output_0"
            ],
            "outputs": [
                "/model.18/cv1/act/Mul_output_0"
            ]
        },
        {
            "name": "/model.22/cv2.0/cv2.0.2/Conv",
            "op_type": "Conv",
            "inputs": [
                "/model.22/cv2.0/cv2.0.1/act/Mul_output_0",
